app/views/users/_user.json.jbuilder

INSERT INTO `users` (`telphone`, `username`, `email`, `created_at`, `updated_at`) VALUES ('123', 'test', 'sdf@mail.com', '2017-04-13 01:41:17', '2017-04-13 01:41:17')
---
json.extract! user, :id, :telphone, :username, :password, :balance, :email, :created_at, :updated_at
json.created_at(user.created_at.strftime('%Y-%m-%d %H:%M:%S'))