app/controllers/categories_controller.rb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`status` = '1' AND `categories`.`id` = 1 LIMIT 1
---
  def categorybystatusandid
    @category = Category.find_by(status: params[:status], id: params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`status` = '1'
---
  def categoriesbystatus
    @categories = Category.where(status: params[:status])