app/controllers/coupons_controller.rb

  def couponsbyuser
    @coupons = Coupon.where(user_id:params[:user_id])
---
SELECT `coupons`.* FROM `coupons` WHERE `coupons`.`user_id` = 1

  def couponbyuserandid
    @coupon = Coupon.find_by(user_id:params[:user_id],id:params[:id])
---
SELECT  `coupons`.* FROM `coupons` WHERE `coupons`.`user_id` = 1 AND `coupons`.`id` = 1 LIMIT 1

  def couponsbytype
    @coupons = Coupon.where(coupon_type:params[:coupon_type])
---
SELECT `coupons`.* FROM `coupons` WHERE `coupons`.`coupon_type` = '\'1\''

  def couponbytypeandid
    @coupon = Coupon.find_by(coupon_type:params[:coupon_type],id:params[:id])
---
SELECT  `coupons`.* FROM `coupons` WHERE `coupons`.`coupon_type` = '2' AND `coupons`.`id` = 1 LIMIT 1