app/controllers/couriers_controller.rb

  def index
    @couriers = Courier.all
---
SELECT `couriers`.* FROM `couriers`

  def couriersbystatus
    @couriers = Courier.where(status: params[:status])
---
SELECT `couriers`.* FROM `couriers` WHERE `couriers`.`status` = '1'