app/controllers/orders_controller.rb

  def ordersbyuser
    @orders = Order.where(user_id: params[:user_id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1

  def ordersbyuserandstatus
    @orders = Order.where(user_id:params[:user_id],status: params[:status])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1 AND `orders`.`status` = 2

  def orderbyuserandid
    @order = Order.find_by(user_id:params[:user_id],id:params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`user_id` = 2 AND `orders`.`id` = 1 LIMIT 1