app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`category_id` = 1
---
  def productsbycategory
    @products = Product.where(category_id: params[:category_id])

SELECT `products`.* FROM `products` WHERE `products`.`status` = '1'
---
  def productsbystatus
    @products = Product.where(status: params[:status])

SELECT  `products`.* FROM `products` WHERE `products`.`status` = '1' AND `products`.`id` = 1 LIMIT 1
---
  def productbystatusandid
    @product = Product.find_by(status: params[:status], id: params[:id])