app/controllers/user_addresses_controller.rb

SELECT `user_addresses`.* FROM `user_addresses`
---
  def index
    @user_addresses = UserAddress.all

SELECT `user_addresses`.* FROM `user_addresses` WHERE `user_addresses`.`user_id` = 1
---
  def user_addressesbyuser
    @user_addresses = UserAddress.where(user_id: params[:user_id])

SELECT  `user_addresses`.* FROM `user_addresses` WHERE `user_addresses`.`user_id` = 1 AND `user_addresses`.`id` = 2 LIMIT 1
---
  def user_addressbyuserandid
    @user_address = UserAddress.find_by(user_id: params[:user_id],id: params[:id])

SELECT  `user_addresses`.* FROM `user_addresses` WHERE `user_addresses`.`id` = 1 LIMIT 1
---
    def set_user_address
      @user_address = UserAddress.find(params[:id])