app/controllers/users_controller.rb

  def login
    @user = User.find_by(telphone: user_params_login[:telphone],password: user_params_login[:password])
---
SELECT  `users`.* FROM `users` WHERE `users`.`telphone` = '18811439817' AND `users`.`password` = '1' LIMIT 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`telphone`, `username`, `password`, `email`, `portrait`, `created_at`, `updated_at`) VALUES ('18811439817', '', '123', '', '', '2017-04-11 02:28:07', '2017-04-11 02:28:07')